[
    {
        "jobTitle": "Frontend Developer",
        "employerName": "Understanding Recruitment",
        "locationName": "N1C4BU",
        "minimumSalary": 60000,
        "maximumSalary": 80000,
        "expirationDate": "03/04/2024",
        "jobDescription": "Frontend Developer JavaScript/TypeScript &amp; React, Angular, or Vue. Hybrid (2x a week in London) Up to 80K Benefits A London startup that is redefining urban transportation using cutting-edge technology. Their mission is to recreate the dynamics of city transport networks in real-time, allowing people and autonomous agents to adapt to changing flows. Key Tech: JavaScript/TypeScript &amp; React, Angular, or Vue. Plus points: Data visualisation... "
    },
    {
        "jobTitle": "Frontend Developer",
        "employerName": "Trust In Soda",
        "locationName": "W113JY",
        "minimumSalary": 400,
        "maximumSalary": 450,
        "expirationDate": "25/04/2024",
        "jobDescription": "Frontend Developer Start Date: 1st April Contract Length: 3 Months Extension Location: Remote, UK Rate: 400 - 450 per day. OUTSIDE IR35 I am currently collaborating a tech company that is actively seeking a Frontend Developer Ideally, we are looking for an individual who can initiate this project by the 1st of April, although we can certainly accommodate a reasonable notice period. You will be responsible for designing and developing user interf... "
    },
    {
        "jobTitle": "Frontend Engineer",
        "employerName": "Understanding Recruitment",
        "locationName": "London",
        "minimumSalary": 60000,
        "maximumSalary": 65000,
        "expirationDate": "23/04/2024",
        "jobDescription": "Frontend Engineer Salary: Up to 65,000 Perks Work Setup: Hybrid (2 days per week onsite) A dynamic London startup, specialiding in the restaurant and food sector, is on the hunt for a talented Frontend Engineer to join their team on a permanent basis. Backed by prominent investors from Silicon Valley, this company is poised for substantial expansion. Key Technologies: JavaScript, React, React Native, Python (Backend), Docker, AWS. In this role, ... "
    },
    {
        "jobTitle": "Frontend Developer",
        "employerName": "Understanding Recruitment",
        "locationName": "London",
        "minimumSalary": 70000,
        "maximumSalary": 75000,
        "expirationDate": "10/04/2024",
        "jobDescription": "Senior Frontend Developer Hybrid Up to 75k At our company, we are at the forefront of combining distributed computing, simulation, and machine learning to revolutionize city transport networks. Our cutting-edge technology enables us to create mirror worlds that accurately predict the flows of people, goods, and vehicles in real-time. We empower both individuals and autonomous agents to anticipate the future dynamics of their environment and make... "
    },
    {
        "jobTitle": "Frontend Developer",
        "employerName": "Noir",
        "locationName": "Watford",
        "minimumSalary": 55000,
        "maximumSalary": 80000,
        "expirationDate": "24/04/2024",
        "jobDescription": "Frontend Developer - Digital Marketing and Gaming Company - Watford (Tech Stack: Frontend Developer, JavaScript, TypeScript, Node, HTML, CSS, React, React Native) I'm representing a dynamic digital marketing and technology agency based in Watford, specialising in online gaming. Our client is at the forefront of innovation, crafting cutting-edge solutions that redefine the digital gaming experience. As they continue to expand, we're seeking a tal... "
    },
    {
        "jobTitle": "Frontend Developer",
        "employerName": "Leo Technology Limited",
        "locationName": "London",
        "minimumSalary": 55000,
        "maximumSalary": 65000,
        "expirationDate": "26/03/2024",
        "jobDescription": "Headline Information: ?? Job Title: Front End Developer (Angular, Typescript) ?? Industry: Higher Education ?? Salary: 55,000- 65,000 ?? Interview process: 1 stage (video interview) ?? Working location: Fully remote (Note - contract will be tied to an office location in London) The Role: We're working with a higher education establishment who are looking to make an exciting new hire for their growing technical team! This is an amazing opportunit... "
    },
    {
        "jobTitle": "Frontend Developer",
        "employerName": "TT TECH SOLUTIONS LTD",
        "locationName": "CM201AA",
        "minimumSalary": 25000,
        "maximumSalary": 30000,
        "expirationDate": "04/04/2024",
        "jobDescription": "We're a dynamic Harlow-based business committed to professionalism and customer satisfaction. Our contemporary office environment fosters growth and includes on-site food facilities. Responsibilities: Develop and maintain responsive web applications (HTML, CSS, JavaScript). Collaborate on user-friendly interfaces with design and back-end teams. Optimize applications for speed, scalability, and cross-browser compatibility. Create and consume APIs... "
    },
    {
        "jobTitle": "Senior Frontend Engineer",
        "employerName": "Plexus",
        "locationName": "EC3R5BT",
        "minimumSalary": 90000,
        "maximumSalary": 110000,
        "expirationDate": "02/04/2024",
        "jobDescription": "Senior Frontend Engineer Web3 DeFi Remote OR Hybrid 90k - 110k per annum Plexus have partnered up with a well funded and rapidly growing DeFi company, offering a decentralised experience for users to to gain access to any pre-public asset. Our client is looking for a Senior Frontend Developer to write clean and re-usable React code, style and animate on Figma specifications and synchronize smart contracts and the subgraph data with client-side s... "
    },
    {
        "jobTitle": "Frontend WordPress Developer",
        "employerName": "Salt Search",
        "locationName": "London",
        "minimumSalary": 30000,
        "maximumSalary": 40000,
        "expirationDate": "09/04/2024",
        "jobDescription": "Frontend WordPress Developer - London Based 30 000.00 - 40 000.00 per annum We have partnered with a dynamic and high-performance website design and development agency based in London is currently seeking a WordPress Developer to join their team. Established in 2014, they have been on an exhilarating journey of growth and success. They aim to supercharge their capabilities, they are expanding their team and inviting an experienced WordPress Deve... "
    },
    {
        "jobTitle": "Frontend Developer - Vue.js",
        "employerName": "SR2",
        "locationName": "London",
        "minimumSalary": 350,
        "maximumSalary": 400,
        "expirationDate": "13/04/2024",
        "jobDescription": "Frontend Developer - Vue.js Vue.js / Outside IR35 Contract: Outside IR35 Length: 6 Months Rate: 350 - 400 per day Location: Fully Remote The Role We are currently working with a leading consultancy who focus on creating sustainable digital capabilities for their clients. They are now on the lookout for a Vue.js Developer to join their team. With a focus on technical design, testing, and implementation of web applications. You'll be working in an... "
    },
    {
        "jobTitle": "Senior Frontend Engineer",
        "employerName": "Hurren & Hope ",
        "locationName": "London",
        "minimumSalary": 60000,
        "maximumSalary": 80000,
        "expirationDate": "18/03/2024",
        "jobDescription": "Senior Frontend Engineer ? Angular or React ? Remote (UK or Europe) - 60,000 to 80,000 ? Ref: JB-35 We have an opportunity for a Senior Frontend Engineer to join an award-winning SaaS scale up. They are a product-first company with over 50% of the employees focusing on Engineering, Product and Design.&nbsp;The Senior Frontend Engineer will be joining the product team to help them scale their existing solutions.&nbsp; We are looking for someone w... "
    },
    {
        "jobTitle": "Senior Frontend Engineer ",
        "employerName": "Plexus",
        "locationName": "EC3R5AA",
        "minimumSalary": 80000,
        "maximumSalary": 100000,
        "expirationDate": "28/03/2024",
        "jobDescription": "Senior Frontend Engineer Web3 Company (Crypto and NFT) Remote 80k - 100k Plexus has a great opportunity with a client operating within the crypto and NFT space. They are a well-established team with a mission to transform the digital art and technology space by creating distinctive products. They are seeking a Senior Frontend Engineer to join the team and help to deliver high quality web applications and contribute to their mission. Responsibili... "
    },
    {
        "jobTitle": "Frontend / Mobile Engineer",
        "employerName": "SR2",
        "locationName": "London",
        "minimumSalary": 45000,
        "maximumSalary": 60000,
        "expirationDate": "28/03/2024",
        "jobDescription": "Frontend/Mobile Engineer London - hybrid (1 day a week or fortnight) 45,000 - 60,000 React Native, React, JavaScript, AWS I have not 1 but 2 opportunities for junior engineers in my network to join London's leading digital events platform. They have successfully broken the mould within a very traditional industry. They are a very fun and fast paced team across the UK and US, focused on developing beautiful user experiences - that are accessible ... "
    },
    {
        "jobTitle": "Senior Frontend Engineer",
        "employerName": "Understanding Recruitment",
        "locationName": "London",
        "minimumSalary": 60000,
        "maximumSalary": 65000,
        "expirationDate": "23/04/2024",
        "jobDescription": "Senior Frontend Developer Up to 65,000 2 days in office ?? Join a Revolutionary Startup Transforming the Restaurant Industry ?? Are you passionate about revolutionizing the restaurant landscape and empowering operators to thrive? Are you ready to be part of a dynamic team dedicated to driving innovation and growth? If so, we have an incredible opportunity for you to make an impact! About Us: We are a team of restaurant aficionados on a mission t... "
    },
    {
        "jobTitle": "Python Developer Automation Video Codec",
        "employerName": "Client Server Ltd.",
        "locationName": "W26LG",
        "minimumSalary": 40000,
        "maximumSalary": 50000,
        "expirationDate": "10/04/2024",
        "jobDescription": "Python Developer (Automation Video Codec) London / WFH to 50k Are you a technologist Python Developer looking to work on complex and interesting systems whilst continually learning and progressing your career in a diverse, supportive environment of innovation that empowers individuals to succeed? You could be joining a technology company that is producing game changing products using AI and parallel processing for data, video, imaging and point ... "
    },
    {
        "jobTitle": "Senior Frontend Developer React",
        "employerName": "Explore Group",
        "locationName": "EC3N1LJ",
        "minimumSalary": 75000,
        "maximumSalary": 85000,
        "expirationDate": "02/04/2024",
        "jobDescription": "Senior React Developer Full time, fully remote 85k salary, must be UK based The Explore Group have partnered up with a leading AI business base din the heart of London that are looking to expand their development team and bring on a Senior Frontend React developer to work on their flagship AI platform. Skills: 5 years frontend development experience in React React, Typescript, HTML, CSS Building react UI components What's on offer: Salary from 7... "
    },
    {
        "jobTitle": "Mandarin speaking Frontend Developer (with sponsorship)",
        "employerName": "People First",
        "locationName": "WC2A1AE",
        "minimumSalary": 30000,
        "maximumSalary": 80000,
        "expirationDate": "03/04/2024",
        "jobDescription": "To see more Chinese jobs please follow us on WeChat: teamchinapf AND pfteamchina Ref: 22358 The S kills You'll Need: Mandarin fluent, TypeScript, React, GraphQL , Web3 Your N ew S alary : up to 70k, depending on experience Hybrid or Remote Perm Start: ASAP Mandarin speaking Frontend developer- What You'll be Doing: Developing User Interfaces: Design and implement user interfaces for decentralized applications, ensuring a seamless and intuitive u... "
    },
    {
        "jobTitle": "Senior Frontend Developer - Vue / Nuxt ",
        "employerName": "Ernest Hunter Green ",
        "locationName": "EC4A1AD",
        "minimumSalary": 80000,
        "maximumSalary": 90000,
        "expirationDate": "25/04/2024",
        "jobDescription": "Our client is a technology company focusing on delivering SaaS solutions that improve the passenger experience across the transport network. They have developed ground-breaking technologies to improve the health and safety of employees and passengers alike, whilst ensuring that the customer experience is central to how transport operators deliver their services. With a focus on inclusivity, they develop innovative technology solutions that make ... "
    },
    {
        "jobTitle": "Frontend Developer Angular - £700 Inside IR35 HYBRID",
        "employerName": "Lorien",
        "locationName": "London",
        "minimumSalary": 650,
        "maximumSalary": 700,
        "expirationDate": "26/04/2024",
        "jobDescription": "Frontend Developer (Angular) - 6 Month Contract ( 700 Inside IR35) - (HYBRID) I am working alongside an award winning investment management organisation, who have an excellent track record of providing an industry leading service for their clients. We are on the lookout for a Frontend Developer who will be working with the Back Office Development team, and help build out an Angular front end to support the Operations team in managing transaction... "
    },
    {
        "jobTitle": "Senior Full Stack Developer Frontend Focused 80/20 - Remote",
        "employerName": "Salt Search",
        "locationName": "London",
        "minimumSalary": 400,
        "maximumSalary": 475,
        "expirationDate": "03/04/2024",
        "jobDescription": "Senior Full Stack Developer (Frontend Focused) - UK - Remote Day rate: 400 - 475 (outside IR35) Duration: 9 months Start: ASAP MUST be able to work US hours on a weekly support rotation 14:00 - 22:00 My new client is looking for a Senior Full Stack developer on a contract basis. The right candidate needs to be more front end focused. Overview: A competent Engineer with 7 years experience 80% Front End | 20% Back End Experience working in an Agil... "
    },
    {
        "jobTitle": "Front End Developer - DV Cleared",
        "employerName": "Searchability",
        "locationName": "London",
        "minimumSalary": 50000,
        "maximumSalary": 75000,
        "expirationDate": "22/03/2024",
        "jobDescription": "FRONTEND DEVELOPER - LONDON NEW PERMANENT OPPORTUNITY AVAILABLE FOR A FRONTEND DEVELOPER IN LONDON WITH SECURITY CLEARANCE Permanent opportunity for a frontend developer in London Must have DV clearance to start 50,000 - 75,000 dependent on experience London based in an easily accessible location To apply please email or call / WHO WE ARE? We are recruiting a frontend developer for a prestigious client in London using cutting edge technology. Ou... "
    },
    {
        "jobTitle": "Lead Developer",
        "employerName": "Leo Technology Limited",
        "locationName": "London",
        "minimumSalary": 80000,
        "maximumSalary": 100000,
        "expirationDate": "04/04/2024",
        "jobDescription": "Headline Information: ?? Job Title: Lead Developer - Frontend (Angular, Typescript, SaaS) ?? Industry: EdTech / SaaS Applications ?? Salary: 80,000 - 100,000 ?? Interview process: 3 stages ?? Working location: Remote first (UK based) ?? Start Date Flexible The Role: I'm working with a highly successful and rapidly growing EdTech who are looking for a Lead Developer - Frontend to take control of the frontend development practices of the business,... "
    },
    {
        "jobTitle": "Front End Developer",
        "employerName": "Noir",
        "locationName": "London",
        "minimumSalary": 45000,
        "maximumSalary": 60000,
        "expirationDate": "09/04/2024",
        "jobDescription": "Frontend Developer Frontend Developer - G lobal Software Company - Hybrid - London (Tech stack: Frontend Developer, React, HTML, CSS &amp; JavaScript, Frontend Developer) Our client is Global Software company that focuses on digital transformation for thousands of workplace operators. My client has a fantastic platform that can be used to run workspaces and to help operators to support and upscale their business to keep up with the industry that... "
    },
    {
        "jobTitle": "Senior JavaScript Engineer",
        "employerName": "Plexus",
        "locationName": "SW111ED",
        "minimumSalary": 70000,
        "maximumSalary": 90000,
        "expirationDate": "02/04/2024",
        "jobDescription": "Senior JavaScript Engineer Multi-Chain Wallet Integrator Remote 70K- 90K The opportunity to join a long-standing crypto-wallet integration company. This company help mobile wallet users to easily connect to desktop apps and support app developers to integrate a wide range of wallet functionality in their own developments. They are looking for a Frontend, detail oriented, JavaScript Engineer to join the team to help build fantastic web experience... "
    },
    {
        "jobTitle": "Lead Front End Developer Chinese Speaking",
        "employerName": "BeTechnology Group Limited",
        "locationName": "London",
        "minimumSalary": 70000,
        "maximumSalary": 100000,
        "expirationDate": "10/04/2024",
        "jobDescription": "Job Role: Lead Front End Developer (Chinese Speaking) Location: Hybrid (3 days on-site per week in London) Salary: 70,000 - 100,000 Benefits include: Flexible working hours. 26 days holidays plus bank holidays. Opportunity to work on ambitious projects in an exciting setting. A collaborative and professional working environment. Opportunities for professional advancement within the company. My client is a prominent iGaming development company, t... "
    },
    {
        "jobTitle": "Full Stack Developer",
        "employerName": "Understanding Recruitment",
        "locationName": "EC2M7PP",
        "minimumSalary": 50000,
        "maximumSalary": 60000,
        "expirationDate": "22/03/2024",
        "jobDescription": "Would you like to dip your toes into the wonderful world of AI? Are you a Full Stack Developer with experience working with Java or Kotlin on the backend, as well as JavaScript and React on the frontend? Full Stack Developer - AI for Optimisation ?? Salary - up to 60,000 ?? Location - hybrid flexibility in London We have a brand new unmissable opportunity for a Full Stack Developer to gain exposure and experience working in the ever-expanding fi... "
    },
    {
        "jobTitle": "Front End Developer - Remote",
        "employerName": "Candidate Source - TEAM",
        "locationName": "EC1V7DU",
        "minimumSalary": 50000,
        "maximumSalary": 60000,
        "expirationDate": "21/03/2024",
        "jobDescription": "A growing business committed to developing software solutions that drive the business forward is looking for a fully remote Front End Developer with a strong background in React, Next.js and Typescript. They value creativity, dedication, and a team-oriented mindset. Their environment is dynamic, fast-paced, and focused on delivering exceptional user experiences.&nbsp; This role is critical in creating responsive, user-centric web applications an... "
    },
    {
        "jobTitle": "Angular Developer AI Software",
        "employerName": "Ernest Gordon Recruitment Limited",
        "locationName": "London",
        "minimumSalary": 70000,
        "maximumSalary": 80000,
        "expirationDate": "20/03/2024",
        "jobDescription": "Angular Developer ( AI Software ) 70,000 - 80,000 Progression Fully WFH Remote / London Are you an Angular Developer looking to join a thriving pioneer of artificial intelligence video analytics (A.I.V.A.) that are working on the latest advancements of AI Software and are at the forefront of innovation in the UK? Do you want the opportunity to work on software used by government bodies, manufacturing companies and casinos to regulate CCTV footag... "
    },
    {
        "jobTitle": "Senior Analyst Developer - Perm £90k  bonus - Insurance",
        "employerName": "Lorien",
        "locationName": "EC3A4AF",
        "minimumSalary": 85000,
        "maximumSalary": 95000,
        "expirationDate": "04/04/2024",
        "jobDescription": "Senior Analyst Developer - Perm 95k bonus - Insurance A global insurance specialist is looking to hire a Senior Analyst Developer to support a business-critical transformation to migrate an application from Python to. NET. Working with 2 other developers, you will be working on refactoring and rewriting an exposure management application to create a robust and scalable application for future development. This is a full-stack role where the devel... "
    },
    {
        "jobTitle": "Senior Analyst Developer",
        "employerName": "i3 Resourcing Limited",
        "locationName": "EC3V3ND",
        "minimumSalary": 90000,
        "maximumSalary": 95000,
        "expirationDate": "12/04/2024",
        "jobDescription": "Senior Analyst Developer 95,000 amazing bonus and benefits Permanent City of London - Hybrid MUST HAVE INSURANCE BACKGROUND .NET and Python Specialist Python/.NET with little UI backend; Python fixing bugs, refactoring code, removing technical debt exposure to Frontend Great opportunity to allow someone to become a subject matter expert, can progress their career to move into CAT modelling, capital allocation, pricing. 5-8years experience MINIMU... "
    },
    {
        "jobTitle": "Developer Back End",
        "employerName": "Just IT ",
        "locationName": "London",
        "minimumSalary": 50000,
        "maximumSalary": 700000,
        "expirationDate": "15/03/2024",
        "jobDescription": "Full Stack Engineer fully remote up to 70k Role Overview: As a Full-Stack Engineer with a specialization in infrastructure backend development at Ritual, you will be responsible for designing, building, and maintaining the core infrastructure that powers our applications. You'll work closely with cross-functional teams to ensure the reliability and performance of our backend systems while contributing to the overall architecture and development ... "
    },
    {
        "jobTitle": "PHP Laravel/ Vue Developer  Remote  Outside IR35  3 months",
        "employerName": "Opus Recruitment Solutions Ltd",
        "locationName": "London",
        "minimumSalary": 250,
        "maximumSalary": 300,
        "expirationDate": "25/03/2024",
        "jobDescription": "PHP Laravel / Vue Developer | Remote | Outside IR35 | My client in the finance sector is looking to take on a contractor to help with an ongoing Laravel project. They are looking for an experienced and independent contractor to come on board, bringing their knowledge and expertise to the already existing team. Essential skills: Strong Laravel and proven experience working fullstack with Vue JS frontend in the past 3 years. Position: Contract ful... "
    },
    {
        "jobTitle": "Senior Backend Developer",
        "employerName": "Plexus",
        "locationName": "EC3R5AQ",
        "minimumSalary": 90000,
        "maximumSalary": 110000,
        "expirationDate": "02/04/2024",
        "jobDescription": "Senior Backend Developer Web3 Finance Remote 90k - 110k Plexus has a great opportunity with a client operating within the decentralised and centralised digital assets space. They are well-established platform operating with an aim to create one accessible place for both centralised and decentralised crypto trading. They are seeking a Senior Backend Engineer to join not only an exciting business that offers interesting work, but also the chance t... "
    },
    {
        "jobTitle": "Fullstack Engneer",
        "employerName": "TEC PARTNERS LIMITED",
        "locationName": "London",
        "minimumSalary": 60000,
        "maximumSalary": 80000,
        "expirationDate": "15/03/2024",
        "jobDescription": "Fullstack Engineer Hybrid - London I'm working with an exciting Greentech startup using cutting edge technology to help homeowners decarbonise their homes and save money. They're utilising cutting edge 3D scanning and AI to do this. They're on the hunt for a Fullstack Software Engineer to join their small (but growing) engineering team to drive their mission and work on their vast technical offerings across web, mobile and tablet. Requirements *... "
    },
    {
        "jobTitle": "Full Stack Engineer, React, Java, Springboot, Remote",
        "employerName": "Sanderson",
        "locationName": "London",
        "minimumSalary": 600,
        "maximumSalary": 650,
        "expirationDate": "18/03/2024",
        "jobDescription": "Full Stack Engineer, React, Java, Springboot, Remote Sanderson are recruiting for a Full Stack Engineer to work for a large retail client. You will be apart of a larger team with multiple engineers, testers and customer engagement coworkers. The role will be focused on mainly joining the web team. Day Rate: 600 - 650pd (Overall Assignment to Umbrella) - Inside IR35 Contract Length: 6 months Working Style: Remote - one day a month on site in Lond... "
    },
    {
        "jobTitle": "Software Engineer",
        "employerName": "Yolk Recruitment Ltd",
        "locationName": "London",
        "minimumSalary": 60000,
        "maximumSalary": 80000,
        "expirationDate": "18/04/2024",
        "jobDescription": "Software Engineer | Java or Python | Up to 80,000 | High Level Clearance Required | National Security Consultancy | London | Yolk Recruitment are working with a national security consultancy based in London. They're searching for multiple software engineers to join due to an influx of new projects. They have multiple roles available across different teams &amp; are open to engineers with backend experience in Java or Python. The roles are backen... "
    },
    {
        "jobTitle": "Angular Developer (NgRx, RxJS)  - Remote Within UK",
        "employerName": "Arden Resourcing Limited",
        "locationName": "EC1A1BB",
        "minimumSalary": 50000,
        "maximumSalary": 60000,
        "expirationDate": "06/04/2024",
        "jobDescription": "Angular Developer (NgRx, RxJS) - Remote Within UK 50,000 - 60,000 My client is looking for an Angular Developer to join their expanding team and help continue the innovation of their website and mobile app. You’ll be involved in all aspects of their software development lifecycle including requirements gathering, planning, design, coding and testing. Who should apply for this position? You are ready to make the move to a senior role having been ... "
    },
    {
        "jobTitle": "Senior Python Engineer",
        "employerName": "Explore Group",
        "locationName": "London",
        "minimumSalary": 60000,
        "maximumSalary": 80000,
        "expirationDate": "04/04/2024",
        "jobDescription": "Senior Python Engineer Hybrid working Office location: London, UK Salary: Up to 80,000 per annum equity Explore Group have partnered with a successful scale-up ecommerce company who are revolutionising the online shopping experience. They are seeking a Senior Python Full Stack Engineer to help drive their platform to new heights. Role Overview: As a Senior Python Full Stack Engineer, you will play a pivotal role in building and maintaining their... "
    },
    {
        "jobTitle": "Data Engineer - SC Cleared - OUTSIDE IR35",
        "employerName": "Sanderson",
        "locationName": "London",
        "minimumSalary": 480,
        "maximumSalary": 510,
        "expirationDate": "02/04/2024",
        "jobDescription": "Role : Data Engineer Day Rate : 480 - 510p/d (dependant on SFIA Level experience) - OUTSIDE IR35 Location : London (hybrid) Clearance required : ACTIVE SC clearance Duration : Initially short term until end of March (due to Financial Year) with 1 year extension Are you a Data Engineer, with strong Kafka / Streaming data experience , looking to work for a high-calibre Consultancy pioneering innovation in the Public Sector? We're on the look out f... "
    },
    {
        "jobTitle": "Python Software Engineer GCP, Docker & AI/ML - Contract",
        "employerName": "Lorien",
        "locationName": "London",
        "minimumSalary": null,
        "maximumSalary": null,
        "expirationDate": "18/04/2024",
        "jobDescription": "Python Software Engineer (GCP, Docker &amp; AI/ML) - Contract A leading pharmaceutical company are looking for a Python Software Engineer to join them on a 6-month initial contract, with hybrid working based in their offices in London 2 / 3 days a week. Please note this role will be paid via an umbrella company. Key skills required: Back-end development for a Python web application Integration of AI/ML components with frontend, data and compute ... "
    },
    {
        "jobTitle": "Python Developer, Django",
        "employerName": "Sanderson",
        "locationName": "London",
        "minimumSalary": 600,
        "maximumSalary": 750,
        "expirationDate": "19/04/2024",
        "jobDescription": "Python Developer 650 - 750/day overall assignment rate to umbrella Mostly remote - occasional site visits in London 3 month initial contract Looking for a Python Developer to work with the wider Platform Engineering team to develop and maintain software platforms. developing high-quality software platforms for the Data Science team to achieve business challenges Python Developer, key skills: Knowledge and experience in Django and Python backend.... "
    },
    {
        "jobTitle": "Senior Python Engineer",
        "employerName": "Explore Group",
        "locationName": "London",
        "minimumSalary": 75000,
        "maximumSalary": 95000,
        "expirationDate": "03/04/2024",
        "jobDescription": "Senior Software Engineer (Python, some React) Full time, UK Fully remeote, 75,000 - 95,000 The Explore Group have partnered up with a leading eCommerce business looking to launch a new brand within their business and are now looking to hire a Senior Full stack engineer with strong Python backend experience and ideally some frontend React. You will have the chance to work with latest technologies and also AI/ML solutions. Skills: 5 years Python e... "
    },
    {
        "jobTitle": "Lead Python Developer",
        "employerName": "Understanding Recruitment",
        "locationName": "London",
        "minimumSalary": 60000,
        "maximumSalary": 75000,
        "expirationDate": "25/03/2024",
        "jobDescription": "Role: Lead Software Engineer / Team Lead Location: London OR Kyiv (Ukraine) OR Lisbon (Portugal) Salary: €60,000 - €70,000 equity benefits Our client is a platform that connects businesses with a network of expert advisors and consultants. The platform facilitates real-time insights and expert opinions through on-demand consultations, allowing companies to make informed decisions across various industries. Your responsibilities as a tech lead wi... "
    },
    {
        "jobTitle": "Senior Solutions Architect",
        "employerName": "Noir",
        "locationName": "Watford",
        "minimumSalary": 100000,
        "maximumSalary": 130000,
        "expirationDate": "24/04/2024",
        "jobDescription": "Senior Solutions Architect - Digital Marketing and Gaming Company - Watford (Tech Stack: Senior Solutions Architect, as TypeScript, PHP, SQL, RDBMS, NoSQL, AWS) I'm representing a leading digital marketing and technology agency based in Watford, specialising in online gaming. Our client is at the forefront of innovation, crafting cutting-edge solutions that redefine the digital gaming experience. As they continue to expand, they are seeking a se... "
    },
    {
        "jobTitle": "Senior Java Developer FinTech Start Up - FX",
        "employerName": "Understanding Recruitment",
        "locationName": "WC1N2LX",
        "minimumSalary": 100000,
        "maximumSalary": 120000,
        "expirationDate": "25/04/2024",
        "jobDescription": "Senior Java Developer Salary - up to 120k 25% bonus Hybrid Working Are you ready to take your Java development skills to the next level and work on a globally renowned trading platform that handles a staggering 5 billion messages per day? Our exclusive client, a global trading vendor, is seeking a Senior Java Developer to join their team and help build out their platform used by investment banks, hedge funds and asset managers worldwide. As a Se... "
    },
    {
        "jobTitle": "Senior Python Engineer",
        "employerName": "Explore Group",
        "locationName": "London",
        "minimumSalary": 70000,
        "maximumSalary": 95000,
        "expirationDate": "17/04/2024",
        "jobDescription": "Senior Python Full Stack Engineer Hybrid working Office location: London, UK Salary: Up to 95,000 per annum equity Explore Group have partnered with a successful scale-up ecommerce company who are revolutionising the online shopping experience. They are seeking a Senior Python Full Stack Engineer to help drive their platform to new heights. Role Overview: As a Senior Python Full Stack Engineer, you will play a pivotal role in building a new ecom... "
    },
    {
        "jobTitle": "Backend WordPress Developer",
        "employerName": "Salt Search",
        "locationName": "London",
        "minimumSalary": 40000,
        "maximumSalary": 50000,
        "expirationDate": "10/04/2024",
        "jobDescription": "Backend WordPress Developer - London 40 000.00 - 50 000.00 per annum We have partnered with a dynamic and high-performance website design and development agency based in London is currently seeking a Backend WordPress Developer to join their team. Established in 2014, they have been on an exhilarating journey of growth and success. They aim to supercharge their capabilities, they are expanding their team and inviting an experienced Back End Word... "
    },
    {
        "jobTitle": "Remote Rust Developer - Derivatives",
        "employerName": "Understanding Recruitment",
        "locationName": "SE10AA",
        "minimumSalary": 130000,
        "maximumSalary": 165000,
        "expirationDate": "03/04/2024",
        "jobDescription": "Senior Rust Engineer - Derivatives Up to 165k EUR Remote from anywhere in Europe (must have right to work) Rust Engineers! Join an exciting and fast-growing derivatives exchange seeking experienced Rust Engineers to work fully remotely (95% of the workforce do) or in their Brussels office should you like office time. The team is pioneering exotic derivative products in the crypto world, with a potential multi-trillion dollar market value in the ... "
    },
    {
        "jobTitle": "IOS Engineer",
        "employerName": "SR2",
        "locationName": "London",
        "minimumSalary": 70000,
        "maximumSalary": 80000,
        "expirationDate": "24/04/2024",
        "jobDescription": "IOS Developer - London - Greenfield - 80,000 Most serious illnesses are detected in A&amp;E or after a trip to hospital for something minor and it's picked up on a scan or in a test. Sadly for many, they are at the point of no return despite this being an illness that's treatable if caught early. In this role you are helping contribute to the design of a product that's the start of a revolution to bring healthcare into the home. Imagine being at... "
    },
    {
        "jobTitle": "Senior Software Engineer",
        "employerName": "Understanding Recruitment",
        "locationName": "London",
        "minimumSalary": 80000,
        "maximumSalary": 100000,
        "expirationDate": "10/04/2024",
        "jobDescription": "Senior Frontend Developer Shoreditch - 3 days a week in office Up to 100,000 As an AI-first company, its mission is to construct a groundbreaking photo and video creation platform, empowering content creators and brands globally. Their state-of-the-art technology, driven by groundbreaking facial recognition and generative AI features, sets new standards for digital excellence. The dynamic team behind a transformative project is seeking a visiona... "
    },
    {
        "jobTitle": "Senior Backend Engineer - Ruby",
        "employerName": "Hurren & Hope ",
        "locationName": "London",
        "minimumSalary": 75000,
        "maximumSalary": 90000,
        "expirationDate": "03/04/2024",
        "jobDescription": "Senior Backend Engineer (Multiple roles) ? Ruby, Rails, RoR ? Remote (UK or Europe) - 75,000 to 90,000 ? Ref: JB33 We have a number of new opportunities for Senior Backend / Ruby Engineer?s to join an award-winning SaaS scale up. The successful candidates&nbsp;will be joining the product team who make up 50% of the business. Working within one of the 4 x Agile Scrum Squads, you will be responsible for developing, enhancing and maintaining their ... "
    },
    {
        "jobTitle": "Full Stack Engineer",
        "employerName": "Hurren & Hope ",
        "locationName": "London",
        "minimumSalary": 60000,
        "maximumSalary": 80000,
        "expirationDate": "26/03/2024",
        "jobDescription": "Full Stack Developer ? React, Node.js, TypeScript, AWS, SaaS, Start-up ? Remote (UK Based) - 60,000 to 80,000 ? Ref: JB37 We have a new opportunity for a Full Stack Developer to join a start-up who are building a brand-new Cybersecurity SaaS platform. The Main tech stack consists of React, Node.js, TypeScript and AWS.&nbsp; The role would suit someone who loves working in innovative start up environments. Although they follow best practice where... "
    },
    {
        "jobTitle": "Full Stack Software Developer",
        "employerName": "Advantage Resourcing",
        "locationName": "London",
        "minimumSalary": 60000,
        "maximumSalary": 60000,
        "expirationDate": "11/04/2024",
        "jobDescription": "Full Stack Software Developer REMOTE 60k per annum ( Share options, token options and unlimited holiday) Our client is a global leader in providing monetization applications for companies all over the world. The platform they use helps deliver value that boost revenues, increase margins and enable rapid responses to changing market dynamics and volatility. If you have expertise within the Blockchain space, 3/5 years as a Full Stack Dev utilising... "
    },
    {
        "jobTitle": "Full-Stack Engineer",
        "employerName": "Henderson Scott",
        "locationName": "London",
        "minimumSalary": 50000,
        "maximumSalary": 59000,
        "expirationDate": "25/03/2024",
        "jobDescription": "Are you a Full-Stack Engineer looking for a role in a high growth company? Want to work fully remote and have an opportunity to work flexi-time hours? If so.. read on. My client who is in the Cyber EdTech space has a leading gamified learning platform with over 2 million end users. ?? Founded in 2018, the platform has rapidly grown since it's inception. In essence, they are hypergrowth Cyber EdTech company that believes in making learning cyber ... "
    },
    {
        "jobTitle": "Senior Full Stack Developer",
        "employerName": "Searchability",
        "locationName": "London",
        "minimumSalary": 115000,
        "maximumSalary": 115000,
        "expirationDate": "24/04/2024",
        "jobDescription": "Full Stack Developer Requirement for Mid and Senior AWS, Terraform Key Skills: Python, JavaScript, AWS, Next.JS, React, Webpack, FastAPI, Docker Salary from 50,000 up to 115,000 Hybrid working arrangements Responsibilities: Taking ownership of our application, ensuring it is well-maintained and continuously evolves over time Writing and documenting clean, adaptable, and scalable code. Building new features and products from the ground up. Crafti... "
    },
    {
        "jobTitle": "Lead Software Developer",
        "employerName": "Understanding Recruitment",
        "locationName": "EC1V9BD",
        "minimumSalary": 90000,
        "maximumSalary": 120000,
        "expirationDate": "16/03/2024",
        "jobDescription": "Would you like to put your technical experience to good and make a positive impact on the world? Enjoy the flexibility of working from home? REMOTE Lead Software Developer - Solve the NHS Staffing Crisis Location: London on average 1 day per month Package: Up to 120k shares benefits We are working with a fantastic 'HealthTech meets Tech for Good' start-up who, after an exciting year of growth last year, are looking to continue scaling with a Lea... "
    },
    {
        "jobTitle": "Java Engineer - GreenTech/Tech for Good",
        "employerName": "Understanding Recruitment",
        "locationName": "EC1Y1BE",
        "minimumSalary": 80000,
        "maximumSalary": 100000,
        "expirationDate": "30/03/2024",
        "jobDescription": "Java Engineer - GreenTech/Tech for Good ?? Fully remote opportunity. Must be based in the UK ?? 80,000 - 100,000 benefits Are you ready to make a difference and be part of the movement towards a sustainable future? Join an exciting and rapidly growing digital start-up that specialises in creating consumer goods for sustainable energy. They are searching for a skilled Java Engineer to join their dynamic team of 40 software developers. With a tota... "
    },
    {
        "jobTitle": "DevOps Engineer/Cloud Developer",
        "employerName": "Sanderson",
        "locationName": "London",
        "minimumSalary": 50000,
        "maximumSalary": 60000,
        "expirationDate": "05/04/2024",
        "jobDescription": "Role responsibilities: Interacting with project roles as required, to gain an understanding of the business environment, technical context, and organisational strategic direction. Advising our customer on the latest technologies and methodologies, designing and implementing innovative approaches to their problems using automation. Understanding security policies and implementing solutions to satisfy security requirements. Designing and implement... "
    },
    {
        "jobTitle": "Senior Software Engineer (Backend)",
        "employerName": "Sedex Information Exhange Ltd",
        "locationName": "EC4M7BA",
        "minimumSalary": 70000,
        "maximumSalary": 85000,
        "expirationDate": "19/04/2024",
        "jobDescription": "The role We are looking for an experienced software engineer to join one of our multi-functional product delivery teams. You will primarily work on backend services in Kotlin but will be expected to contribute to the frontend codebase (React.js) at times as well, with support from our frontend specialists. You will be a product-minded engineer, working together with the product manager and designer in your team to understand customer needs and w... "
    },
    {
        "jobTitle": "Senior Software Engineer",
        "employerName": "Understanding Recruitment",
        "locationName": "AL11AG",
        "minimumSalary": 100000,
        "maximumSalary": 125000,
        "expirationDate": "07/04/2024",
        "jobDescription": "Are you looking to progress your career and lead a team in exciting challenging projects? Senior Software Engineer - Sports Data Location - Hertfordshire (20 mins from Kings Cross) 2 days per week Salary - 100-125,000 30% bonus We have a fantastic opportunity for a Senior Software Engineer who is ready to take the next step in their career and become a leader in both technical decisions as well as acting as a guiding mentor for their team. You w... "
    },
    {
        "jobTitle": "Senior .Net Developer",
        "employerName": "Understanding Recruitment",
        "locationName": "AL11AG",
        "minimumSalary": 100000,
        "maximumSalary": 125000,
        "expirationDate": "30/03/2024",
        "jobDescription": "Are you looking to progress your career and lead a team in exciting challenging projects? Senior .Net Developer - Sports Data Location - Hertfordshire (20 mins from Kings Cross) 2 days per week Salary - 100-125,000 30% bonus We have a fantastic opportunity for a Senior .Net Developer who is ready to take the next step in their career and become a leader in both technical decisions as well as acting as a guiding mentor for their team. You will be... "
    },
    {
        "jobTitle": "Senior Software Engineer",
        "employerName": "Understanding Recruitment",
        "locationName": "AL11AG",
        "minimumSalary": 100000,
        "maximumSalary": 125000,
        "expirationDate": "24/03/2024",
        "jobDescription": "Are you looking to progress your career and lead a team in exciting challenging projects? Senior Software Engineer - Sports Data Location - Hertfordshire (20 mins from Kings Cross) 2 days per week Salary - 100-125,000 30% bonus We have a fantastic opportunity for a Senior Software Engineer who is ready to take the next step in their career and become a leader in both technical decisions as well as acting as a guiding mentor for their team. You w... "
    },
    {
        "jobTitle": "PHP Developer",
        "employerName": "Addition",
        "locationName": "WD62XX",
        "minimumSalary": 65000,
        "maximumSalary": 65000,
        "expirationDate": "18/04/2024",
        "jobDescription": "We are currently working on behalf of out trusted client who are looking for a PHP Developer. Join our client, a leading player in the pet health services and insurance industry, as they aim to secure the coveted position of the UK's #1 Pet Insurer. What You Can Expect Work Type - Contract - 6 months. Salary - 65k Location - Borehamwood (Hybrid - once a week in the office) Main Responsibilities as a PHP Developer Maintain legacy code base. Devel... "
    },
    {
        "jobTitle": "Principal Full Stack Engineer",
        "employerName": "Understanding Recruitment",
        "locationName": "EC1V9BD",
        "minimumSalary": 90000,
        "maximumSalary": 120000,
        "expirationDate": "23/03/2024",
        "jobDescription": "Have you got experience leading a team while also remaining technically hands-on? Do you like using modern technology to solve real world problems? Principal Full Stack Engineer - HealthTech Salary - up to 120,000 extensive benefits package Location - hybrid working (2 days a week in Central London office) We are so excited to be partnered with a Series B funded HealthTech scale-up based in central London on their search for a Principal Full Sta... "
    },
    {
        "jobTitle": "Senior Front End Developer Chinese Speaking",
        "employerName": "BeTechnology Group Limited",
        "locationName": "London",
        "minimumSalary": 50000,
        "maximumSalary": 100000,
        "expirationDate": "09/04/2024",
        "jobDescription": "Job Role: Senior Front End Developer (Chinese Speaking) Location: Hybrid (3 days on-site per week in London) Salary: Up to 100K DOE Benefits include: Flexible working hours. 26 days holidays plus bank holidays. Opportunity to work on ambitious projects in an exciting setting. A collaborative and professional working environment. Opportunities for professional advancement within the company. My client stands at the forefront of the iGaming sector... "
    },
    {
        "jobTitle": "Principal Full Stack Engineer",
        "employerName": "Understanding Recruitment",
        "locationName": "EC1V9BD",
        "minimumSalary": 90000,
        "maximumSalary": 120000,
        "expirationDate": "16/03/2024",
        "jobDescription": "Have you got experience leading a team while also remaining technically hands-on? Do you like using modern technology to solve real world problems? Principal Full Stack Engineer - HealthTech Salary - up to 120,000 extensive benefits package Location - hybrid working (2 days a week in Central London office) We are so excited to be partnered with a Series B funded HealthTech scale-up based in central London on their search for a Principal Full Sta... "
    },
    {
        "jobTitle": "Web Designer",
        "employerName": "ADLIB",
        "locationName": "SE19AL",
        "minimumSalary": null,
        "maximumSalary": null,
        "expirationDate": "12/04/2024",
        "jobDescription": "A fast-growing Shopify eCommerce Agency, based in London, are looking for a Web Designer to join their team to continue building on the great reputation they already have in the industry. What you’ll be doing Since starting, they have gone from strength to strength. These guys are honest, no mess, but incredibly supportive. You’ll be joining them as their team expands and exciting new projects come available as well as their regulars are also bu... "
    },
    {
        "jobTitle": "Shopify Developer",
        "employerName": "ADLIB",
        "locationName": "SE19AL",
        "minimumSalary": null,
        "maximumSalary": null,
        "expirationDate": "29/03/2024",
        "jobDescription": "A fast-growing Shopify eCommerce Agency, based in London, are looking for a Shopify Developer to join their team to continue building on the great reputation they already have in the industry. What you’ll be doing Since starting, they have gone from strength to strength. These guys are honest, no mess, but incredibly supportive. You’ll be joining them as their team expands and exciting new projects come available as well as their regulars are al... "
    },
    {
        "jobTitle": "Lead Software Developer",
        "employerName": "Understanding Recruitment",
        "locationName": "EC1V9BD",
        "minimumSalary": 90000,
        "maximumSalary": 120000,
        "expirationDate": "23/03/2024",
        "jobDescription": "Would you like to put your technical experience to good and make a positive impact on the world? Enjoy the flexibility of working from home? REMOTE Lead Software Developer - Solve the NHS Staffing Crisis Location: London on average 1 day per month Package: Up to 120k shares benefits We are working with a fantastic 'HealthTech meets Tech for Good' start-up who, after an exciting year of growth last year, are looking to continue scaling with a Lea... "
    },
    {
        "jobTitle": "React Developer - FX Options - Global Hegdefund",
        "employerName": "Huxley",
        "locationName": "London",
        "minimumSalary": 850,
        "maximumSalary": 851,
        "expirationDate": "19/04/2024",
        "jobDescription": "A client I'm working with who is a Global Hedgefund is looking for a Java/React Developer to join their team based in London on a long term contract position. Role Description: React developer role within the FX Derivatives and Risk team to build and extend FX Options and Risk frontend application suite. Essential Skills Excellent programming skills in any OOP language including but not limited to Java and Python. Very good knowledge and experie... "
    },
    {
        "jobTitle": "Senior Software Engineer",
        "employerName": "Understanding Recruitment",
        "locationName": "AL11AG",
        "minimumSalary": 100000,
        "maximumSalary": 125000,
        "expirationDate": "21/04/2024",
        "jobDescription": "Are you looking to progress your career and lead a team in exciting challenging projects? Senior Software Engineer - Sports Data Location - Hertfordshire (20 mins from Kings Cross) 2 days per week Salary - 100-125,000 30% bonus We have a fantastic opportunity for a Senior Software Engineer who is ready to take the next step in their career and become a leader in both technical decisions as well as acting as a guiding mentor for their team. You w... "
    },
    {
        "jobTitle": "Senior Software Engineer",
        "employerName": "Understanding Recruitment",
        "locationName": "AL11AG",
        "minimumSalary": 100000,
        "maximumSalary": 125000,
        "expirationDate": "20/03/2024",
        "jobDescription": "Are you looking to progress your career and lead a team in exciting challenging projects? Senior Software Engineer - Sports Data Location - Hertfordshire (20 mins from Kings Cross) 2 days per week Salary - 100-125,000 30% bonus We have a fantastic opportunity for a Senior Software Engineer who is ready to take the next step in their career and become a leader in both technical decisions as well as acting as a guiding mentor for their team. You w... "
    },
    {
        "jobTitle": "Senior Tech Lead - AWS & NodeJS",
        "employerName": "Salt Search",
        "locationName": "London",
        "minimumSalary": 650,
        "maximumSalary": 650,
        "expirationDate": "12/04/2024",
        "jobDescription": "We are seeking a skilled and experienced Senior AWS &amp; Node JS Tech Lead to join our team. As an Node JS, AWS Serverless Backend Developer, you will be responsible for designing, developing, and maintaining scalable and high-performing serverless backend services and APIs on the AWS platform. You will leverage AWS Lambda, API Gateway, DynamoDB, and other serverless services to build robust and reliable cloud-based solutions. Please note that ... "
    },
    {
        "jobTitle": ".NET Developer",
        "employerName": "Hays Specialist Recruitment Limited",
        "locationName": "London",
        "minimumSalary": 100000,
        "maximumSalary": 150000,
        "expirationDate": "12/04/2024",
        "jobDescription": "Job Title: .NET Developer Company: Asset Manager Location: London, UK Department: Systems Team About Our Client: Our client is a leading specialist currency and asset manager with a substantial portfolio of over $100 billion in Assets Under Management Equivalent. With a focus on currency management, sustainable finance, and asset management, our client serves a diverse range of institutional clients including pension funds, charities, foundation... "
    },
    {
        "jobTitle": "Java / React Developer - FX  - Global Hegdefund",
        "employerName": "Huxley",
        "locationName": "London",
        "minimumSalary": 850,
        "maximumSalary": 851,
        "expirationDate": "19/04/2024",
        "jobDescription": "A client I'm working with who is a Global Hedgefund is looking for a Java/React Developer to join their team based in London on a long term contract position. Role Description: Java React developer role within the FX Derivatives and Risk team to build and extend FX Options and Risk frontend application suite. Essential Skills Excellent programming skills in any OOP language including but not limited to Java and Python. Very good knowledge and ex... "
    },
    {
        "jobTitle": "Senior Software Engineer",
        "employerName": "Understanding Recruitment",
        "locationName": "AL11AG",
        "minimumSalary": 100000,
        "maximumSalary": 125000,
        "expirationDate": "14/04/2024",
        "jobDescription": "Are you looking to progress your career and lead a team in exciting challenging projects? Senior Software Engineer - Sports Data Location - Hertfordshire (20 mins from Kings Cross) 2 days per week Salary - 100-125,000 30% bonus We have a fantastic opportunity for a Senior Software Engineer who is ready to take the next step in their career and become a leader in both technical decisions as well as acting as a guiding mentor for their team. You w... "
    },
    {
        "jobTitle": "Senior Software Engineer",
        "employerName": "Additional Resources Ltd",
        "locationName": "London",
        "minimumSalary": 600,
        "maximumSalary": 700,
        "expirationDate": "18/04/2024",
        "jobDescription": "Senior Software Engineer Location: UK Remote Salary: 600 - 700 per day Excellent Benefits The Client: Our client, a prominent organisation, collaborates with the NHS to empower researchers in discovering disease causes and developing innovative treatments, with a focus on prioritising patients and participants. The Role: As a Senior Software Engineer , you will play a pivotal role in leading all phases of the software development lifecycle. Resp... "
    },
    {
        "jobTitle": "Engineering Manager",
        "employerName": "Understanding Recruitment",
        "locationName": "London",
        "minimumSalary": 90000,
        "maximumSalary": 110000,
        "expirationDate": "02/04/2024",
        "jobDescription": "Location: London / Hybrid Salaray: 90,000 - 110,000 basic equity Engineering Manager - Join a High-Growth FinTech Startup Are you an experienced engineering manager ready to take on a career-defining opportunity? We are seeking an Engineering Manager to join our team. We are building the next generation of financial compliance solutions, focusing on empowering employees to trade stocks and manage their financial wellbeing with ease. About Us: We... "
    },
    {
        "jobTitle": "Engineering Lead",
        "employerName": "SRGEurope",
        "locationName": "London",
        "minimumSalary": null,
        "maximumSalary": null,
        "expirationDate": "29/03/2024",
        "jobDescription": "Engineering Lead | Crypto/Blockchain | London, hybrid working (UK applications only) Engineering Lead required for an exciting non-profit organisation headquartered in London. They are supported by one of the biggest names in Crypto. Please note for the Engineering Lead, experience within blockchain is essential. What's on offer to you? Exciting opportunity within environmental impact of Crypto Working with Crypto / blockchain intelligence syste... "
    },
    {
        "jobTitle": "WordPress Developer",
        "employerName": "Merchr",
        "locationName": "London",
        "minimumSalary": 30000,
        "maximumSalary": 40000,
        "expirationDate": "17/04/2024",
        "jobDescription": "WordPress Developer Merchr Location – Hybrid with 2 days in office (London N19 – offices within walking distance of Archway tube station) Salary: 30k to 40k DOE Benefits Please Note: Applicants must be eligible to work in the UK. Merchr is our new and innovative content monetisation platform that gives brands, influencers, musicians, sportspeople, attractions, charities, schools and more, a unique opportunity to create their own merchandise. We ... "
    },
    {
        "jobTitle": "SEO Manager ",
        "employerName": "AT Talent Ltd",
        "locationName": "London",
        "minimumSalary": 45000,
        "maximumSalary": 55000,
        "expirationDate": "02/04/2024",
        "jobDescription": "ABOUT THE ROLE: Salary up to 55K We are looking for an SEO Account Manager. We’d expect the candidate to have excellent technical and content SEO skills to help resolve complex SEO challenges collaboratively with developers, content producers and other digital stakeholders. The role is suitable for an SEO Account Manager with a good amount of client facing experience who is looking for more opportunities to help develop the team and product offe... "
    },
    {
        "jobTitle": "Python Engineer - Django ",
        "employerName": "Searley Owen Ltd",
        "locationName": "Canary Wharf",
        "minimumSalary": 70000,
        "maximumSalary": 75000,
        "expirationDate": "27/04/2024",
        "jobDescription": "Software Engineer Salary - 75,000 per annum London Location Senior Developer required for a leading non for profit in Canary Wharf. You will be responsible for the design and development of both internal web portals and the company website. (Redesign and maintenance.) Current stack: Django framework. Frontend (React) backend (Django/Python) database (PostgreSQL). The ideal candidate will be a full stack developer with Django and Python, and Reac... "
    },
    {
        "jobTitle": "Full Stack Developer",
        "employerName": "POSTIFY LIMITED",
        "locationName": "SG137QX",
        "minimumSalary": 42000,
        "maximumSalary": 47000,
        "expirationDate": "02/04/2024",
        "jobDescription": "Full Stack Developer Our client is seeking a Full Stack Developer to join their succesful team. As a Full Stack Developer, you will build and maintain our hosting platform's user interface. Utilising PHP for backend functionalities and Vue.js for frontend components. You will work with content management systems and ensure that design and user experience are aligned, optimising web pages for maximum effectiveness and maintaining brand consistenc... "
    },
    {
        "jobTitle": "Senior Frontend Engineer",
        "employerName": "eFinancialCareers",
        "locationName": "London",
        "minimumSalary": null,
        "maximumSalary": null,
        "expirationDate": "25/04/2024",
        "jobDescription": "Key responsibilities for this role will include: The development of interactive data visualisations, infographics, and digital experiences for clients. The development of animations and graphics to enhance visual experience. Providing elegant and straightforward solutions to complex challenges. Requirements for this role include the following: A high-level knowledge of design toolsets and the methods of transforming creative elements for use as ... "
    },
    {
        "jobTitle": "Frontend Developer- Thriving Software Development Start-Up",
        "employerName": "eFinancialCareers",
        "locationName": "London",
        "minimumSalary": null,
        "maximumSalary": null,
        "expirationDate": "25/04/2024",
        "jobDescription": "Our client combines distributed computing, simulation and machine learning to recreate the second by second dynamics of city transport networks. These mirror worlds give both people and autonomous agents the ability to foresee the near future of the flows of people, goods and vehicles in the environment around them and adjust their behaviour accordingly. Using this technology, they've developed an autonomous fleet scheduling and dispatch system ... "
    },
    {
        "jobTitle": "Senior Lead Software Engineer",
        "employerName": "eFinancialCareers",
        "locationName": "London",
        "minimumSalary": null,
        "maximumSalary": null,
        "expirationDate": "25/04/2024",
        "jobDescription": "Your responsibilities: Develop and deliver software to address a wide range of business problems. Hire, develop and line manage a team of high performing software engineers. Plan and organize your projects so they are delivered under appropriate timescales and be flexible where relevant factors change. Lead the engineering team hands-on to ensure all software developed is functionally complete, performant and supportable. Be equally happy workin... "
    },
    {
        "jobTitle": ".Net Fullstack Developer - C# Node, React, Angular - Insurance",
        "employerName": "eFinancialCareers",
        "locationName": "London",
        "minimumSalary": null,
        "maximumSalary": null,
        "expirationDate": "25/04/2024",
        "jobDescription": "Looking for a developer with approximately 3 years of experience in Fullstack development; C# Node.js - back-end; HTML, CSS, JavaScript, and various frameworks (e.g., React, Angular) front-end. Responsible for the development of both frontend web applications and backend development using C# and or Node.js. &nbsp;Database Design and Management including data modelling, optimisation, and integration. Designing, developing, and integrating APIs to... "
    },
    {
        "jobTitle": "Senior Software Engineer, Backend Role is in Amsterdam, Onsite",
        "employerName": "eFinancialCareers",
        "locationName": "London",
        "minimumSalary": null,
        "maximumSalary": null,
        "expirationDate": "25/04/2024",
        "jobDescription": "At Airwallex (airwallex.com) , we're building the future of global finance on one platform. Founded in 2015 in Melbourne, Airwallex is the leading financial technology platform for modern businesses to grow beyond borders. With one of the world's most powerful payments infrastructure, our technology empowers businesses of all sizes to accept payments, move money globally, and simplify their financial operations, all on one single platform. If yo... "
    }
]